[
    {"id": "q1", "query": "What is the effective date range of the GEO agreement?"},
    {"id": "q2", "query": "Who are the parties involved in the GEO agreement?"},
    {"id": "q3", "query": "Which employees are included in the GEO bargaining unit?"},
    {"id": "q4", "query": "Which employees are excluded from the GEO bargaining unit?"},
    {"id": "q5", "query": "What types of duties does a Teaching Assistant perform under the GEO contract?"},
    {"id": "q6", "query": "What types of duties does a Graduate Assistant perform under the GEO contract?"},
    {"id": "q7", "query": "What is the minimum FTE required for eligibility for a GEO assistantship?"},
    {"id": "q8", "query": "What happens if a graduate assistant loses academic eligibility during the appointment?"},
    {"id": "q9", "query": "What employment documents must be completed before starting an assistantship?"},
    {"id": "q10", "query": "How soon must offer letters be issued before the start of an appointment according to GEO rules?"},
    {"id": "q11", "query": "What information must be included in a GEO appointment letter?"},
    {"id": "q12", "query": "How long should an assistant be employed under a standard GEO appointment?"},
    {"id": "q13", "query": "What are the eligibility criteria for reappointment under the GEO agreement?"},
    {"id": "q14", "query": "Which student fees are waived for graduate assistants under the GEO agreement?"},
    {"id": "q15", "query": "How much of the International Student Fee is waived each semester for GEO members?"},
    {"id": "q16", "query": "What are the rules regarding parking fee increases for GEO employees?"},
    {"id": "q17", "query": "How are disputes over job classification handled under the GEO grievance procedure?"},
    {"id": "q18", "query": "What rights do GEO assistants have to review their personnel files?"},
    {"id": "q19", "query": "What does the GEO agreement state about discrimination and harassment?"},
    {"id": "q20", "query": "What does the GEO no-strike and no-lockout clause state?"},
    {"id": "q21", "query": "Who are the parties to the Non-Tenure Track Faculty agreement?"},
    {"id": "q22", "query": "When is the NTT Faculty agreement effective?"},
    {"id": "q23", "query": "Which faculty members are included in the NTT bargaining unit?"},
    {"id": "q24", "query": "Which colleges are excluded from the NTT Faculty agreement?"},
    {"id": "q25", "query": "What management rights are reserved by the University under the NTT contract?"},
    {"id": "q26", "query": "What is the University’s policy on non-discrimination and harassment for NTT faculty?"},
    {"id": "q27", "query": "What are the minimum salaries for NTT faculty by rank?"},
    {"id": "q28", "query": "How are annual salary increases determined for NTT faculty?"},
    {"id": "q29", "query": "What are compression and equity adjustments under the NTT contract?"},
    {"id": "q30", "query": "What professional expense reimbursements are available to NTT faculty?"},
    {"id": "q31", "query": "What benefits are provided to NTT faculty under the agreement?"},
    {"id": "q32", "query": "How does the NTT agreement define academic freedom?"},
    {"id": "q33", "query": "What process governs discipline and dismissal of NTT faculty?"},
    {"id": "q34", "query": "How can NTT faculty participate in university governance?"},
    {"id": "q35", "query": "What does the NTT agreement state about labor management meetings?"},
    {"id": "q36", "query": "What is the duration of the Tenure Track Faculty agreement?"},
    {"id": "q37", "query": "What are the minimum salary levels for Assistant, Associate, and Full Professors in the TT agreement?"},
    {"id": "q38", "query": "How are merit-based salary increases calculated for tenure system faculty?"},
    {"id": "q39", "query": "What are equity adjustments in the TT faculty salary plan?"},
    {"id": "q40", "query": "What does the TT faculty agreement say about academic freedom?"},
    {"id": "q41", "query": "How does the University handle non-reappointment of tenure system faculty?"},
    {"id": "q42", "query": "What grievance and arbitration procedures apply to tenure system faculty?"},
    {"id": "q43", "query": "What management rights does the University retain under the TT faculty contract?"},
    {"id": "q44", "query": "What diversity and affirmative action provisions are included in the TT faculty agreement?"},
    {"id": "q45", "query": "How are labor management meetings handled under the TT faculty contract?"},
    {"id": "q46", "query": "Who is represented by the Committee of Interns and Residents (CIR) agreement?"},
    {"id": "q47", "query": "What is the duration of the CIR contract?"},
    {"id": "q48", "query": "What does the CIR agreement say about non-physician duties for residents?"},
    {"id": "q49", "query": "How does the CIR agreement address resident wellness and fatigue mitigation?"},
    {"id": "q50", "query": "What salary or stipend provisions are included for residents and fellows in the CIR agreement?"}
]
